return {
  {
    "nvimdev/dashboard-nvim",
    event = "VimEnter",
    opts = function()
      local opts = {
        theme = "doom",
        config = {
          header = {
            "",
            "",
            "",
            "",
            "",
            " ███████╗██████╗ ██╗███████╗ ██████╗ ███╗   ██╗██╗    ██╗",
            " ██╔════╝██╔══██╗██║██╔════╝██╔═══██╗████╗  ██║██║    ██║",
            " █████╗  ██║  ██║██║███████╗██║   ██║██╔██╗ ██║██║ █╗ ██║",
            " ██╔══╝  ██║  ██║██║╚════██║██║   ██║██║╚██╗██║██║███╗██║",
            " ███████╗██████╔╝██║███████║╚██████╔╝██║ ╚████║╚███╔███╔╝",
            " ╚══════╝╚═════╝ ╚═╝╚══════╝ ╚═════╝ ╚═╝  ╚═══╝ ╚══╝╚══╝ ",
            "",
            "",
          },
          center = {
            { action = "ene | startinsert", desc = " New file", icon = "📄 ", key = "n" },
            { action = "Telescope find_files", desc = " Find file", icon = "🔍 ", key = "f" },
            { action = "Telescope oldfiles", desc = " Recent files", icon = "📂 ", key = "r" },
            { action = "Telescope live_grep", desc = " Find text", icon = "🔎 ", key = "g" },
            { action = "Lazy", desc = " Lazy", icon = "💤 ", key = "l" },
            { action = "qa", desc = " Quit", icon = "❌ ", key = "q" },
          },
          footer = function()
            return { "⚡ Neovim loaded" }
          end,
        },
      }
      return opts
    end,
  },
  -- Deshabilitar el dashboard de LazyVim
  { "folke/snacks.nvim", opts = { dashboard = { enabled = false } } },
}
